app/controllers/octo_controller.rb

INSERT INTO `applications` (`name`, `created_at`, `updated_at`) VALUES('teambox', '2010-05-21 00:30:39', '2010-05-21 00:30:39')
---
  def index
    STR.each do |str|
      1.upto(5).each do |i|
        begin
          s_url = "http://github.com/api/v2/yaml/repos/search/#{str}?start_page=#{i}"
          puts s_url
          yaml = open(s_url)
          xml = YAML.parse(yaml).transform.to_xml
          doc_search = Nokogiri::XML(xml)
          doc_search.xpath("/hash/repositories/repository").each do |repo|
            s_username = repo.xpath('./username').text
            s_application = repo.xpath('./name').text
            i_followers = repo.xpath('./followers').text.to_i
            i_score = repo.xpath('./score').text.to_f
            next if i_followers < 2

            puts "-- #{s_username} #{s_application}"

            application = Application.find_or_create_by_name(s_application)

INSERT INTO `plugins` (`name`, `created_at`, `updated_at`) VALUES(' .. ', '2010-05-21 00:30:39', '2010-05-21 00:30:39')
---

                puts s_plugin

                application.plugins << Plugin.find_or_create_by_name(s_plugin)